export const begin = [
    "做好课前准备!",
    "上课！（降调）",
    "（……五分钟新课……）",
];

export const beforeExe = [
    "先说这个dīng正作业。我一个礼拜就收这样的一次，有的同学就订正了3道题，你真的就只错了3道题？",
    "接下来我们处理作业，我把答案写在黑板上，同学们批改一下。",
    "下面看试卷, 要养成写名字的好习惯，拿到卷子写上名字。下次谁不写名字就撕掉！",
]

export const correction = [
    "（下来兜一圈）",
    "对的题要打对er号！",
    "一道一道地改！",
    "我都兜了一圈了有的同学还没改完！",
]

export const exercise = [
    "我来讲一下错的比较多的问题。",
    "有些同学上来第一题就错！",
    "审题不清！",
    "总gǎn觉到同学们公式不熟！",
    "公式公式就是这种形式，连次序都不rún许改！",
    "我觉得没什么好讲的。",
    "在我眼里没有难题！",
    "第3题，错的举手！",
    "将近有一半的同学错了",
    "不举？你给我等着！",
    "这个问题我强调了多少遍！",
    "总gán觉到同学们对于我说过的问题不给予足够的重视！",
    "这道题考试前一天刚讲过！",
    "我没讲过别的方法，就讲过π-",
    "不rún许有并！我看谁有病！",
    "k∈Z不要忘写！",
    "定义域要用集合给出！",
    "xxx你看看你，就没对几个！",
    "xxx，你还会些啥？",
    "我先设一个t",
    "把这个式子展开，就能dě到这样一件事情——",
    "我们来yān究这样一个函数。",
    "研究函数先研究定义域！",
    "我哪里写错了？……怎么了？我又写错了？……你看错两次就对了……又写错了，这题不讲了，你们自己讨论！",
]

export const judgement = [
    "上午第一节课就犯困！",
    "你不明白为什么要这么做！",
    "总gán觉到同学们对数学学习没有热情！",
    "我们没有形成数学学习的氛围。",
    "应该要有这样的领头羊。",
    "（跟1班的）差距一次比一次大！",
    "迷信点说，是不是我们命中注定要这样……",
    "同学们写份反思。",
    "我的作业真的很少了。",
    "还gě那er玩游戏！",
    "不要为了完成作业而ěr去完成作业！",
    "我一个问题问下去，没有人反应，这就是市重点中学所谓的实验班？",
    "有些同学去网上搜答案，你下次碰到了还得错！",
]

export const interaction = [
    "卷子叠叠好！",
    "xxx字写写好！",
    "cnr，把腿放下来！",
    "就说我们的课代表，能代表些啥？",
    "我发现一个现象，有的题，要错就一整排一起错。我们把这个现象叫做wry现象。",
]

export const homework = [
    "今天的作业，一课一练，就这样的两套题。",
]

export const reflection = [
    "希望同学们能批评我！",
    "你们给我提的意见，让我上课多讲些例题。接下来我都不在了。（笑）",
]

export const quoteGroup = [
    begin, beforeExe, correction, exercise, judgement, interaction, homework, reflection
]

export const quotes = [].concat(...quoteGroup);
